---
kind: property
id: P:Autodesk.Revit.DB.CylindricalFace.Radius(System.Int32)
source: html/28ec91d3-51a5-5864-073d-1f3526e466cd.htm
---
# Autodesk.Revit.DB.CylindricalFace.Radius Property

Radii of the surface.

## Syntax (C#)
```csharp
public XYZ this[
	int index
] { get; }
```

## Parameters
- **index** (`System.Int32`)